Revit 2024 API
BuiltInFailures.SteelElementFailures.SteelElementPreviewTaskNotFinished Property
 Cannot create preview while background calculations are in progress.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SteelElementPreviewTaskNotFinished { get; }
Visual Basic
Public Shared ReadOnly Property SteelElementPreviewTaskNotFinished As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SteelElementPreviewTaskNotFinished {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SteelElementFailures Class
Autodesk.Revit.DB Namespace